In [37]:
# ! pip install sqlalchemy 
# ! pip install pymysql

Keyring is skipped due to an exception: 'keyring.backends'
Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.7/site-packages (1.4.52)
Requirement already satisfied: greenlet!=0.4.17; python_version >= "3" and (platform_machine == "aarch64" or (platform_machine == "ppc64le" or (platform_machine == "x86_64" or (platform_machine == "amd64" or (platform_machine == "AMD64" or (platform_machine == "win32" or platform_machine == "WIN32")))))) in /opt/anaconda3/lib/python3.7/site-packages (from sqlalchemy) (0.4.15)
Requirement already satisfied: importlib-metadata; python_version < "3.8" in /opt/anaconda3/lib/python3.7/site-packages (from sqlalchemy) (6.7.0)
Requirement already satisfied: typing-extensions>=3.6.4; python_version < "3.8" in /opt/anaconda3/lib/python3.7/site-packages (from importlib-metadata; python_version < "3.8"->sqlalchemy) (4.7.1)
Requirement already satisfied: zipp>=0.5 in /opt/anaconda3/lib/python3.7/site-packages (from importlib-metadata; python_version < "3.8"->sqlalchemy) (2.2.0)

In [2]:
import pandas as pd
from sqlalchemy import create_engine 
import pymysql.cursors
import os
import getpass
import urllib.parse

In [3]:
urllib.parse.quote_plus('!')

'%21'

In [4]:
urllib.parse.quote_plus('é')

'%C3%A9'

In [5]:
pw_raw = "Eatyourdinner0991" # os.getenv('key_sql')
pw = urllib.parse.quote_plus(pw_raw)

In [6]:
#engine = sqlalchemy.create_engine(f"mysql://{username}:{password}@{host}:{port}")

connection_string = 'mysql+pymysql://root:' + pw + '@localhost:3306/'
engine = create_engine(connection_string)

In [7]:
with engine.connect() as conn:
    conn.execute(f"CREATE DATABASE IF NOT EXISTS a_new_db_262")

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: RemovedIn20Warning: Deprecated API features detected! These feature(s) are not compatible with SQLAlchemy 2.0. To prevent incompatible upgrades prior to updating applications, ensure requirements files are pinned to "sqlalchemy<2.0". Set environment variable SQLALCHEMY_WARN_20=1 to show all deprecation warnings.  Set environment variable SQLALCHEMY_SILENCE_UBER_WARNING=1 to silence this message. (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)

In [8]:
df = pd.DataFrame({'Column1':[12,23,45]})

In [9]:
df

   Column1
0       12
1       23
2       45

In [10]:
df.to_sql('our_new_table',engine, 'a_new_db_262', if_exists='replace', index=False)

In [11]:
sql = """
select *
from classicmodels.payments
"""

In [12]:
new_df = pd.read_sql_query(sql, engine)
new_df

     customerNumber checkNumber paymentDate    amount
0               103    HQ336336  2004-10-19   6066.78
1               103    JM555205  2003-06-05  14571.44
2               103    OM314933  2004-12-18   1676.14
3               112    BO864823  2004-12-17  14191.12
4               112     HQ55022  2003-06-06  32641.98
..              ...         ...         ...       ...
268             495    BH167026  2003-12-26  59265.14
269             495    FN155234  2004-05-14   6276.60
270             496    EU531600  2005-05-25  30253.75
271             496    MB342426  2003-07-16  32077.44
272             496     MN89921  2004-12-31  52166.00

[273 rows x 4 columns]

In [13]:
new_df2 = pd.read_sql_table('payments',engine,'classicmodels')

In [14]:
new_df2

     customerNumber checkNumber paymentDate    amount
0               103    HQ336336  2004-10-19   6066.78
1               103    JM555205  2003-06-05  14571.44
2               103    OM314933  2004-12-18   1676.14
3               112    BO864823  2004-12-17  14191.12
4               112     HQ55022  2003-06-06  32641.98
..              ...         ...         ...       ...
268             495    BH167026  2003-12-26  59265.14
269             495    FN155234  2004-05-14   6276.60
270             496    EU531600  2005-05-25  30253.75
271             496    MB342426  2003-07-16  32077.44
272             496     MN89921  2004-12-31  52166.00

[273 rows x 4 columns]

In [15]:

#Write a Python function called rentals_month that retrieves rental data for a given month and year 
#(passed as parameters) from the Sakila database as a Pandas DataFrame. 
#The function should take in three parameters:

#engine: an object representing the database connection engine to be used to establish a connection 
#to the Sakila database.
#month: an integer representing the month for which rental data is to be retrieved.
#year: an integer representing the year for which rental data is to be retrieved.
#The function should execute a SQL query to retrieve the rental data for the specified month and year 
#from the rental table in the Sakila database, and return it as a pandas DataFrame.

#Develop a Python function called rental_count_month that takes the DataFrame provided by 
#rentals_month as input along with the month and year and returns a new DataFrame containing 
#the number of rentals made by each customer_id during the selected month and year.

#The function should also include the month and year as parameters and use them to name 
#the new column according to the month and year, for example, if the input month is 05 and the year is 
#2005, the column name should be "rentals_05_2005".

#Hint: Consider making use of pandas groupby()

#Create a Python function called compare_rentals that takes two DataFrames as input 
#containing the number of rentals made by each customer in different months and years. 
#The function should return a combined DataFrame with a new 'difference' column, which 
#is the difference between the number of rentals in the two months.

In [22]:
#engine = sqlalchemy.create_engine(f"mysql://{username}:{password}@{host}:{port}")

connection_string = 'mysql+pymysql://root:' + pw + '@localhost:3306/'
engine = create_engine(connection_string)

with engine.connect() as conn:
    conn.execute(f"CREATE DATABASE IF NOT EXISTS a_new_db_262")

In [19]:
#retrieves the rental data for the specified month and year


def rentals_month(engine, month, year):
    """retrieves the rental data for the specified month and year using an SQL query"""
    query_month = month
    query_year = year
    year=0
    date_df = pd.read_sql_query(sql,engine)
    conn.execute(f"""SELECT * from rental,  from rental where month = month
                 
                 """)
    return df

In [35]:
df = rentals_month(engine, 5, 2005)

/opt/anaconda3/lib/python3.7/site-packages/pandas/io/sql.py:320: SAWarning: Did not recognize type 'geometry' of column 'location'
  meta.reflect(only=[table_name], views=True)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53

In [36]:
df["rental_date"]

TypeError: 'NoneType' object is not subscriptable

In [ ]:
def rental_count_month(engine, month, year):